STM8user/stm8s103f3/headers/gpio.h
#define EXTI_CR1 *(unsigned char*)0x50A0
#define EXTI_CR2 *(unsigned char*)0x50A1

#define PA_ODR *(unsigned char*)0x5000
#define PA_IDR *(unsigned char*)0x5001
#define PA_DDR *(unsigned char*)0x5002
#define PA_CR1 *(unsigned char*)0x5003
#define PA_CR2 *(unsigned char*)0x5004

#define PB_ODR *(unsigned char*)0x5005
#define PB_IDR *(unsigned char*)0x5006
#define PB_DDR *(unsigned char*)0x5007
#define PB_CR1 *(unsigned char*)0x5008
#define PB_CR2 *(unsigned char*)0x5009

#define PC_ODR *(unsigned char*)0x500A
#define PC_IDR *(unsigned char*)0x500B
#define PC_DDR *(unsigned char*)0x500C
#define PC_CR1 *(unsigned char*)0x500D
#define PC_CR2 *(unsigned char*)0x500E

#define PD_ODR *(unsigned char*)0x500F
#define PD_IDR *(unsigned char*)0x5010
#define PD_DDR *(unsigned char*)0x5011
#define PD_CR1 *(unsigned char*)0x5012
#define PD_CR2 *(unsigned char*)0x5013

#define PE_ODR *(unsigned char*)0x5014
#define PE_IDR *(unsigned char*)0x5015
#define PE_DDR *(unsigned char*)0x5016
#define PE_CR1 *(unsigned char*)0x5017
#define PE_CR2 *(unsigned char*)0x5018

#define PF_ODR *(unsigned char*)0x5019
#define PF_IDR *(unsigned char*)0x501A
#define PF_DDR *(unsigned char*)0x501B
#define PF_CR1 *(unsigned char*)0x501C
#define PF_CR2 *(unsigned char*)0x501D
//////////////////////////
#define PA_ODR_ODR0 (1<<0)
#define PA_ODR_ODR1 (1<<1)
#define PA_ODR_ODR2 (1<<2)
#define PA_ODR_ODR3 (1<<3)
#define PA_ODR_ODR4 (1<<4)
#define PA_ODR_ODR5 (1<<5)
#define PA_ODR_ODR6 (1<<6)
#define PA_ODR_ODR7 (1<<7)

#define PA_IDR_IDR0 (1<<0)
#define PA_IDR_IDR1 (1<<1)
#define PA_IDR_IDR2 (1<<2)
#define PA_IDR_IDR3 (1<<3)
#define PA_IDR_IDR4 (1<<4)
#define PA_IDR_IDR5 (1<<5)
#define PA_IDR_IDR6 (1<<6)
#define PA_IDR_IDR7 (1<<7)

#define PA_DDR_DDR0 (1<<0)
#define PA_DDR_DDR1 (1<<1)
#define PA_DDR_DDR2 (1<<2)
#define PA_DDR_DDR3 (1<<3)
#define PA_DDR_DDR4 (1<<4)
#define PA_DDR_DDR5 (1<<5)
#define PA_DDR_DDR6 (1<<6)
#define PA_DDR_DDR7 (1<<7)

#define PA_CR1_C10 (1<<0)
#define PA_CR1_C11 (1<<1)
#define PA_CR1_C12 (1<<2)
#define PA_CR1_C13 (1<<3)
#define PA_CR1_C14 (1<<4)
#define PA_CR1_C15 (1<<5)
#define PA_CR1_C16 (1<<6)
#define PA_CR1_C17 (1<<7)

#define PA_CR2_C20 (1<<0)
#define PA_CR2_C21 (1<<1)
#define PA_CR2_C22 (1<<2)
#define PA_CR2_C23 (1<<3)
#define PA_CR2_C24 (1<<4)
#define PA_CR2_C25 (1<<5)
#define PA_CR2_C26 (1<<6)
#define PA_CR2_C27 (1<<7)
//////////////////////////
#define PB_ODR_ODR0 (1<<0)
#define PB_ODR_ODR1 (1<<1)
#define PB_ODR_ODR2 (1<<2)
#define PB_ODR_ODR3 (1<<3)
#define PB_ODR_ODR4 (1<<4)
#define PB_ODR_ODR5 (1<<5)
#define PB_ODR_ODR6 (1<<6)
#define PB_ODR_ODR7 (1<<7)

#define PB_IDR_IDR0 (1<<0)
#define PB_IDR_IDR1 (1<<1)
#define PB_IDR_IDR2 (1<<2)
#define PB_IDR_IDR3 (1<<3)
#define PB_IDR_IDR4 (1<<4)
#define PB_IDR_IDR5 (1<<5)
#define PB_IDR_IDR6 (1<<6)
#define PB_IDR_IDR7 (1<<7)

#define PB_DDR_DDR0 (1<<0)
#define PB_DDR_DDR1 (1<<1)
#define PB_DDR_DDR2 (1<<2)
#define PB_DDR_DDR3 (1<<3)
#define PB_DDR_DDR4 (1<<4)
#define PB_DDR_DDR5 (1<<5)
#define PB_DDR_DDR6 (1<<6)
#define PB_DDR_DDR7 (1<<7)

#define PB_CR1_C10 (1<<0)
#define PB_CR1_C11 (1<<1)
#define PB_CR1_C12 (1<<2)
#define PB_CR1_C13 (1<<3)
#define PB_CR1_C14 (1<<4)
#define PB_CR1_C15 (1<<5)
#define PB_CR1_C16 (1<<6)
#define PB_CR1_C17 (1<<7)

#define PB_CR2_C20 (1<<0)
#define PB_CR2_C21 (1<<1)
#define PB_CR2_C22 (1<<2)
#define PB_CR2_C23 (1<<3)
#define PB_CR2_C24 (1<<4)
#define PB_CR2_C25 (1<<5)
#define PB_CR2_C26 (1<<6)
#define PB_CR2_C27 (1<<7)
//////////////////////////
#define PC_ODR_ODR0 (1<<0)
#define PC_ODR_ODR1 (1<<1)
#define PC_ODR_ODR2 (1<<2)
#define PC_ODR_ODR3 (1<<3)
#define PC_ODR_ODR4 (1<<4)
#define PC_ODR_ODR5 (1<<5)
#define PC_ODR_ODR6 (1<<6)
#define PC_ODR_ODR7 (1<<7)

#define PC_IDR_IDR0 (1<<0)
#define PC_IDR_IDR1 (1<<1)
#define PC_IDR_IDR2 (1<<2)
#define PC_IDR_IDR3 (1<<3)
#define PC_IDR_IDR4 (1<<4)
#define PC_IDR_IDR5 (1<<5)
#define PC_IDR_IDR6 (1<<6)
#define PC_IDR_IDR7 (1<<7)

#define PC_DDR_DDR0 (1<<0)
#define PC_DDR_DDR1 (1<<1)
#define PC_DDR_DDR2 (1<<2)
#define PC_DDR_DDR3 (1<<3)
#define PC_DDR_DDR4 (1<<4)
#define PC_DDR_DDR5 (1<<5)
#define PC_DDR_DDR6 (1<<6)
#define PC_DDR_DDR7 (1<<7)

#define PC_CR1_C10 (1<<0)
#define PC_CR1_C11 (1<<1)
#define PC_CR1_C12 (1<<2)
#define PC_CR1_C13 (1<<3)
#define PC_CR1_C14 (1<<4)
#define PC_CR1_C15 (1<<5)
#define PC_CR1_C16 (1<<6)
#define PC_CR1_C17 (1<<7)

#define PC_CR2_C20 (1<<0)
#define PC_CR2_C21 (1<<1)
#define PC_CR2_C22 (1<<2)
#define PC_CR2_C23 (1<<3)
#define PC_CR2_C24 (1<<4)
#define PC_CR2_C25 (1<<5)
#define PC_CR2_C26 (1<<6)
#define PC_CR2_C27 (1<<7)
//////////////////////////
#define PD_ODR_ODR0 (1<<0)
#define PD_ODR_ODR1 (1<<1)
#define PD_ODR_ODR2 (1<<2)
#define PD_ODR_ODR3 (1<<3)
#define PD_ODR_ODR4 (1<<4)
#define PD_ODR_ODR5 (1<<5)
#define PD_ODR_ODR6 (1<<6)
#define PD_ODR_ODR7 (1<<7)

#define PD_IDR_IDR0 (1<<0)
#define PD_IDR_IDR1 (1<<1)
#define PD_IDR_IDR2 (1<<2)
#define PD_IDR_IDR3 (1<<3)
#define PD_IDR_IDR4 (1<<4)
#define PD_IDR_IDR5 (1<<5)
#define PD_IDR_IDR6 (1<<6)
#define PD_IDR_IDR7 (1<<7)

#define PD_DDR_DDR0 (1<<0)
#define PD_DDR_DDR1 (1<<1)
#define PD_DDR_DDR2 (1<<2)
#define PD_DDR_DDR3 (1<<3)
#define PD_DDR_DDR4 (1<<4)
#define PD_DDR_DDR5 (1<<5)
#define PD_DDR_DDR6 (1<<6)
#define PD_DDR_DDR7 (1<<7)

#define PD_CR1_C10 (1<<0)
#define PD_CR1_C11 (1<<1)
#define PD_CR1_C12 (1<<2)
#define PD_CR1_C13 (1<<3)
#define PD_CR1_C14 (1<<4)
#define PD_CR1_C15 (1<<5)
#define PD_CR1_C16 (1<<6)
#define PD_CR1_C17 (1<<7)

#define PD_CR2_C20 (1<<0)
#define PD_CR2_C21 (1<<1)
#define PD_CR2_C22 (1<<2)
#define PD_CR2_C23 (1<<3)
#define PD_CR2_C24 (1<<4)
#define PD_CR2_C25 (1<<5)
#define PD_CR2_C26 (1<<6)
#define PD_CR2_C27 (1<<7)
//////////////////////////
#define PE_ODR_ODR0 (1<<0)
#define PE_ODR_ODR1 (1<<1)
#define PE_ODR_ODR2 (1<<2)
#define PE_ODR_ODR3 (1<<3)
#define PE_ODR_ODR4 (1<<4)
#define PE_ODR_ODR5 (1<<5)
#define PE_ODR_ODR6 (1<<6)
#define PE_ODR_ODR7 (1<<7)

#define PE_IDR_IDR0 (1<<0)
#define PE_IDR_IDR1 (1<<1)
#define PE_IDR_IDR2 (1<<2)
#define PE_IDR_IDR3 (1<<3)
#define PE_IDR_IDR4 (1<<4)
#define PE_IDR_IDR5 (1<<5)
#define PE_IDR_IDR6 (1<<6)
#define PE_IDR_IDR7 (1<<7)

#define PE_DDR_DDR0 (1<<0)
#define PE_DDR_DDR1 (1<<1)
#define PE_DDR_DDR2 (1<<2)
#define PE_DDR_DDR3 (1<<3)
#define PE_DDR_DDR4 (1<<4)
#define PE_DDR_DDR5 (1<<5)
#define PE_DDR_DDR6 (1<<6)
#define PE_DDR_DDR7 (1<<7)

#define PE_CR1_C10 (1<<0)
#define PE_CR1_C11 (1<<1)
#define PE_CR1_C12 (1<<2)
#define PE_CR1_C13 (1<<3)
#define PE_CR1_C14 (1<<4)
#define PE_CR1_C15 (1<<5)
#define PE_CR1_C16 (1<<6)
#define PE_CR1_C17 (1<<7)

#define PE_CR2_C20 (1<<0)
#define PE_CR2_C21 (1<<1)
#define PE_CR2_C22 (1<<2)
#define PE_CR2_C23 (1<<3)
#define PE_CR2_C24 (1<<4)
#define PE_CR2_C25 (1<<5)
#define PE_CR2_C26 (1<<6)
#define PE_CR2_C27 (1<<7)
//////////////////////////
#define PF_ODR_ODR0 (1<<0)
#define PF_ODR_ODR1 (1<<1)
#define PF_ODR_ODR2 (1<<2)
#define PF_ODR_ODR3 (1<<3)
#define PF_ODR_ODR4 (1<<4)
#define PF_ODR_ODR5 (1<<5)
#define PF_ODR_ODR6 (1<<6)
#define PF_ODR_ODR7 (1<<7)

#define PF_IDR_IDR0 (1<<0)
#define PF_IDR_IDR1 (1<<1)
#define PF_IDR_IDR2 (1<<2)
#define PF_IDR_IDR3 (1<<3)
#define PF_IDR_IDR4 (1<<4)
#define PF_IDR_IDR5 (1<<5)
#define PF_IDR_IDR6 (1<<6)
#define PF_IDR_IDR7 (1<<7)

#define PF_DDR_DDR0 (1<<0)
#define PF_DDR_DDR1 (1<<1)
#define PF_DDR_DDR2 (1<<2)
#define PF_DDR_DDR3 (1<<3)
#define PF_DDR_DDR4 (1<<4)
#define PF_DDR_DDR5 (1<<5)
#define PF_DDR_DDR6 (1<<6)
#define PF_DDR_DDR7 (1<<7)

#define PF_CR1_C10 (1<<0)
#define PF_CR1_C11 (1<<1)
#define PF_CR1_C12 (1<<2)
#define PF_CR1_C13 (1<<3)
#define PF_CR1_C14 (1<<4)
#define PF_CR1_C15 (1<<5)
#define PF_CR1_C16 (1<<6)
#define PF_CR1_C17 (1<<7)

#define PF_CR2_C20 (1<<0)
#define PF_CR2_C21 (1<<1)
#define PF_CR2_C22 (1<<2)
#define PF_CR2_C23 (1<<3)
#define PF_CR2_C24 (1<<4)
#define PF_CR2_C25 (1<<5)
#define PF_CR2_C26 (1<<6)
#define PF_CR2_C27 (1<<7)